OdDbBaseHostAppServices.getAppUserName(Oda.UserNameFormat)
\details
Returns user name in the requested format

OdDbBaseHostAppServices.setEnv(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Set environment variable with new value.

OdDbBaseHostAppServices.getEnv(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Get environment variable. If key varName doesn't exist, returns eKeyNotFound.

OdDbBaseHostAppServices.brepBuilder(OdBrepBuilder*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,BrepType)
\details
Initialize brep builder with product specific implementation. Return eNotImplementedYet by default.
\param brepBuilder [in]  instance of brep builder class.
\param bbType [in] type of brep.

OdDbBaseHostAppServices.numThreads(OdDb.MultiThreadedMode)
\details
Returns the number of threads for required multi-threaded mode.

OdDbBaseHostAppServices.getMtMode
\details
MtMode controls if multi-threading is used (bit-coded) See OdDb::MultiThreadedMode
ValueDescription
0              Multi-threaded file loading and regeneration are disabled.
1              Multi-threaded file loading is enabled.
2              Multi-threaded regeneration is enabled.
3              Multi-threaded file loading and regeneration are enabled.

OdDbBaseHostAppServices.getTempPath
\details
Returns the path to the temporary files folder.

OdDbBaseHostAppServices.gsBitmapDevice(OdRxObject*,OdRxObject*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Returns a the gsBitmapDevice associated with this HostAppServices object.
\param pViewObj [in]  OdAbstractViewPE compatible object (OdGsView, OdDbViewport or etc.).
\param pDb [in]  Pointer to the database context.
\param flags [in]  Bitmap device flags.

OdDbBaseHostAppServices.fileDialog(System.Int32,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Prompts the user for a filename, and returns their response.
\param flags [in]  Dialog behavior.
\param dialogCaption [in]  Dialog caption.
\param defExt [in]  Default file extension without "."
\param defFilename [in]  Default filename.
\param filter [in]  Filter pattern.
\remarks
flags must be one of the following:
Name                  Value   Description
kGfpForOpen           0       For Open.
kGfpForSave           1       For Save.
kGfpOverwritePrompt   2       Enable overwrite prompt displaying when exist file selected for saving.
This function is intended for the selection of filenames via dialog boxes,
although other methods may be used.
*  Returns "canceled" if the user cancels the request.
*  Returns "unsupported" if the application does not support this user input.
\remarks
The default implementation of this function does nothing but return "unsupported".

OdDbBaseHostAppServices.collectFilePathsInDirectory(OdArray&lt;OdString,OdObjectsAllocator&lt;OdString&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Collects TrueType font paths.
\param res [out]      Array of full file names of TrueType fonts.
\param sPath [in]    Array of folders paths with TrueType files.
\param sFilter [in]  File name filter.
\sa
Font Handling

OdDbBaseHostAppServices.getSystemFontFolders(OdArray&lt;OdString,OdObjectsAllocator&lt;OdString&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Collects folders with TrueType fonts.
\param aDirs [out]   Array names of folders.
\sa
Font Handling

OdDbBaseHostAppServices.getSubstituteFontByChar(OdFont!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt16,OdRxObject*)
\details
Returns the typeface name of the TTF font which has the character.
\param pFont [in]        Current font.
\param unicodeChar [in]  Current symbol.
\param pDb [in]          Pointer to the database context.
\sa
Font Handling
\remarks
The default implementation uses Windows API for getting the font.

OdDbBaseHostAppServices.getSubstituteFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdTagFontType)
\details
Returns the font to be used when the specified font is not found.
\param fontName [in]  Font name.
\param fontType [in]  Font type.
\remarks
fontType must be one of the following:
Name                    Value    Description
kFontTypeUnknown        0        Unknown.
kFontTypeShx            1        SHX font.
kFontTypeTrueType       2        TrueType font.
kFontTypeShape          3        Shape file.
kFontTypeBig            4        BigFont file.
The default implementation of this function calls getAlternateFontName for
fonts that are not of type kFontTypeShape or kFontTypeBig. When they are,
and empty string is returned.
Client code could override this function to perform custom substitution
for these types of fonts.
\sa
Font Handling

OdDbBaseHostAppServices.getPreferableFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdTagFontType)
\details
Returns the preferable font name for the specified font name and type.
\param fontName [in]  Font name.
\param fontType [in]  Font type.
\remarks
This function is called as the first step in the process of resolving a font file.
The default implementation tries to locate a font mapping file by calling
getFontMapFileName, and substitutes the font name based on the contents of this
file.
fontType must be one of the following:
Name                    Value    Description
kFontTypeUnknown        0        Unknown.
kFontTypeShx            1        SHX font.
kFontTypeTrueType       2        TrueType font.
kFontTypeShape          3        Shape file.
kFontTypeBig            4        BigFont file.
\sa
Font Handling

OdDbBaseHostAppServices.getFontMapFileName
\details
Returns the name of the font mapping file used by the getPreferableFont function.
\sa
Font Handling
\remarks
The default implementation of this function does nothing but return an empty string.
It will be fully implemented in a future release.

OdDbBaseHostAppServices.getAlternateFontName
\details
Returns the font file to be used when a given font file is
not found by the ODA Platform.
\sa
Font Handling

OdDbBaseHostAppServices.ttfFileNameByDescriptor(OdTtfDescriptor!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdString*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Locates the TTF or TTC file containing the specified font description.
\param description [in]  Font description.
\param filename [out]  Receives the name of the TrueType font file.
\returns
Returns true and the filename if and only if the font file was found.
\remarks
The non-Windows builds of this function do nothing but return.

OdDbBaseHostAppServices.auditPrintReport(OdAuditInfo*,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Int32)
\details
Print the audit report for the specified AuditInfo object.
\param pAuditInfo [in]  Pointer to an OdDbAuditInfo object.
\param strLine [in]  The string to print.
\param printDest [in]  Print destination.
\remarks
The default implementation of this function does nothing but return.

OdDbBaseHostAppServices.newUndoStream
\details
Returns an alternate stream object for undo/redo operations.
\remarks
The default implementation of this function always returns a null SmartPointer.
It may return null in the user application. In this case the default memory based stream will be used.
In fact this stream will be used for the current undo/redo step. Other steps can be controlled by
OdDbUndoController.

OdDbBaseHostAppServices.newUndoController
\details
Returns an alternate UndoController object for the ODA Platform.
\remarks
The default implementation of this function always returns a null SmartPointer.
Each database requires at most 2 undo controllers (for undo and redo).

OdDbBaseHostAppServices.formatMessage(System.UInt32,BTEllipsis)
\details
Returns a formatted message corresponding to the specified error code(s).
\param errorCode [in]  Error code.

OdDbBaseHostAppServices.getErrorDescription(System.UInt32)
\details
Returns the error description associated with the specified error code.
\param errorCode [in]  Error code.
\remarks
The default implementation of this function returns formatMessage(errorCode).

OdDbBaseHostAppServices.warning(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdResult)
\details
Displays the specified warning message.
\param warnVisGroup [in]  Group of warning message visibility (always visible if empty).
\param warningOb [in]  Warning object.

OdDbBaseHostAppServices.warning(OdResult)
\details
Displays the specified warning message.
\param warningOb [in]  Warning object.

OdDbBaseHostAppServices.warning(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Displays the specified warning message.
\param warnVisGroup [in]  Group of warning message visibility (always visible if empty).
\param message [in]  Warning message.
\remarks
This function calls odSystemServices()->warning(message) to display the warning.

OdDbBaseHostAppServices.warning(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Displays the specified warning message.
\param message [in]  Warning message.
\remarks
This function calls odSystemServices()->warning(message) to display the warning.

OdDbBaseHostAppServices.versionString
\details
Returns the release version string of the client application.
\remarks
The default implementation of this function returns oddbGetLibraryInfo()->getLibVersion().

OdDbBaseHostAppServices.releaseMinorVersion
\details
Returns the release minor version of the client application.
\remarks
The default implementation of this function returns TD_MINOR_VERSION.

OdDbBaseHostAppServices.releaseMajorVersion
\details
Returns the release major version of the client application.
\remarks
The default implementation of this function returns TD_MAJOR_VERSION.

OdDbBaseHostAppServices.releaseMajorMinorString
\details
Returns the release major and minor version string of the client application.
\remarks
The default implementation of this function returns oddbGetLibraryInfo()->getLibVersion().

OdDbBaseHostAppServices.prodcode
\details
Returns the name of the client product code.
\remarks
This function is typically used for populating "About" information.
prodcode() returns one of the following:
Name          Value   Description
kProd_ACAD    1       Plain
kProd_LT      2       Lite
kProd_OEM     3       OEM
kProd_OdDb    4       ..
\remarks
The default implementation of this function returns kProd_OEM, and should not be overridden.

OdDbBaseHostAppServices.companyName
\details
Returns the name of the client company.
\remarks
This function is typically used for populating "About" information.
\remarks
The default implementation of this function returns oddbGetLibraryInfo()->getCompanyName().

OdDbBaseHostAppServices.product
\details
Returns the name of the client product.
\remarks
This function is typically used for populating "About" information.
\remarks
The default implementation of this function returns program().

OdDbBaseHostAppServices.program
\details
Returns the name of the client program.
\remarks
This function is typically used for populating "About" information.
\remarks
The default implementation of this function returns oddbGetLibraryInfo()->getLibName()

OdDbBaseHostAppServices.releaseProgressMeter(OdDbHostAppProgressMeter*)
\details
Notification function called whenever the specified ProgressMeter object is no longer needed.
\param pProgressMeter [in]  Pointer to the ProgressMeter object no longer needed.
\remarks
The default implementation of this function does nothing but return.

OdDbBaseHostAppServices.newProgressMeter
\details
Returns an instance of an OdDbHostAppProgressMeter.

OdDbBaseHostAppServices.findFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxObject*,OdDbBaseHostAppServices.FindFileHint)
\details
Returns the fully qualified path to the specified file.
\param filename [in]  Name of the file to find.
\param pDb [in]  Pointer to the database context.
\param hint [in]  Hint that indicates the type of file that is required.
\returns
Returns an empty string if the file is not found.
This function is called by the ODA Platform when the database needs access to a
file, such as a font file, a template file, etc.
pDb == 0 specifies that this file search is not related to a database.
If pDb != 0, call pDb->getFilename() to determine the path to the DWG
file associated with the database.
The typical search order is as follows:
1.  The filename itself.
2.  The current directory.
3.  The drawing directory (for shx font, image, and xref files).
4.  The directories listed in the ACAD environment variable.
5.  The Windows fonts directory (only for TTF fonts on Windows).
hint must be one of the following:
Name                    Value     Description Extension
kDefault                0         Any file.                         any
kFontFile               1         Can be either SHX or TTF file.    SHX or TTF
kCompiledShapeFile      2         SHX file.                         SHX
kTrueTypeFontFile       3         TTF file.                         TTF
kEmbeddedImageFile      4         Image file.                       ISM
kXRefDrawing            5         Drawing template file.            DWT
kPatternFile            6         Pattern file (PAT)                PAT
kTXApplication          7         ODA Xtension file.            TX
kFontMapFile            8         FontMap file                      FMP
kUnderlayFile           9         Underlay file
kTextureMapFile        10
\remarks
The client application can, in fact return any non-null string, so long as
the application can handle that string in OdDbSystemServices::createFile.